rcarmo/cydintosh/sdkconfig.defaults.esp32p4
# ESP32-P4 / M5Stack Tab5 experimental LC color configuration
CONFIG_IDF_TARGET="esp32p4"

# Connected Tab5 reports 16MB flash via ESP32-P4 USB-Serial/JTAG.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Tab5 has 32MB hex/16-line PSRAM according to M5Stack docs. Keep it in malloc
# capability pools so later LC RAM/framebuffer allocations can use SPIRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MEMTEST=y

# Performance-oriented build for smoke tests and eventual emulator loops.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Keep task watchdog permissive during early hardware/ROM bring-up.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Console via USB-Serial/JTAG on the Tab5.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Wi-Fi/Bluetooth are not present on ESP32-P4; keep network stacks out of the LC target.
# CONFIG_ESP_WIFI_ENABLED is not set
# CONFIG_BT_ENABLED is not set
